---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyManager..::..GetParameter Method
FamilyManager Class See Also Send Feedback
---

Obtains the family parameter with the given built-in parameter identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022

# Syntax

C#
---

    public FamilyParameter GetParameter(
    	ForgeTypeId parameterTypeId
    )

Visual Basic
---

    Public Function GetParameter ( _
    	parameterTypeId As ForgeTypeId _
    ) As FamilyParameter

Visual C++
---

    public:
    FamilyParameter^ GetParameter(
    	ForgeTypeId^ parameterTypeId
    )

#### Parameters

parameterTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeIdIdentifier of the built-in parameter.

# Remarks

Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the parameter is not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was NULL |

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace